{
 "General": {
  "Attack": ["Make an attack! Choose the weapon you want to attack with and roll."],
  "Cast A Spell": ["Spellcasters such as wizards and clerics, as well as many monsters, have access to spells and can use them to great effect in combat. Each spell has a casting time, which specifies whether the caster must use an action, a reaction, minutes, or even hours to cast the spell. Casting a spell is, therefore, not necessarily an action. Most spells do have a casting time of 1 action, so a spellcaster often uses his or her action in combat to cast such a spell. See chapter 10 for the rules on spellcasting."],
  "Dash": ["When you take the Dash action, you gain extra movement for the current turn. The increase equals your speed, after applying any modifiers. With a speed of 30 feet, for example, you can move up to 60 feet on your turn if you dash.", "Any increase or decrease to your speed changes this additional movement by the same amount. If your speed of 30 feet is reduced to 15 feet, for instance, you can move up to 30 feet this turn if you dash."],
  "Disengage": ["If you take the Disengage action, your movement doesnt provoke opportunity attacks for the rest of the turn."],
  "Dodge": ["When you take the Dodge action, you focus entirely on avoiding attacks. Until the start of your next turn, any attack roll made against you has disadvantage if you can see the attacker, and you make Dexterity saving throws with advantage. You lose this benefit if you are incapacitated or if your speed drops to 0."],
  "Help": ["You can lend your aid to another creature in the completion of a task. When you take the Help action, the creature you aid gains advantage on the next ability check it makes to perform the task you are helping with, provided that it makes the check before the start of your next turn.", "Alternatively, you can aid a friendly creature in attacking a creature within 5 feet of you. You feint, distract the target, or in some other way team up to make your allys attack more effective. If your ally attacks the target before your next turn, the first attack roll is made with advantage."],
  "Opportunity Attack": ["In a fight, everyone is constantly watching for a chance to strike an enemy who is fleeing or passing by. Such a strike is called an opportunity attack.","You can make an opportunity attack when a hostile creature that you can see moves out of your reach. To make the opportunity attack, you use your reaction to make one melee attack against the provoking creature. The attack occurs right before the creature leaves your reach.","You can avoid provoking an opportunity attack by taking the Disengage action. You also dont provoke an opportunity attack when you teleport or when someone or something moves you without using your movement, action, or reaction. For example, you dont provoke an opportunity attack if an explosion hurls you out of a foes reach or if gravity causes you to fall past an enemy."],
  "Ready An Action": ["Sometimes you want to get the jump on a foe or wait for a particular circumstance before you act. To do so, you can take the Ready action on your turn, which lets you act using your reaction before the start of your next turn.","First, you decide what perceivable circumstance will trigger your reaction. Then, you choose the action you will take in response to that trigger, or you choose to move up to your speed in response to it.","When the trigger occurs, you can either take your reaction right after the trigger finishes or ignore the trigger.","When you ready a spell, you cast it as normal but hold its energy, which you release with your reaction when the trigger occurs. To be readied, a spell must have a casting time of 1 action, and holding onto the spells magic requires concentration. If your concentration is broken, the spell dissipates without taking effect. For example, if you are concentrating on the web spell and ready magic missile, your web spell ends, and if you take damage before you release magic missile with your reaction, your concentration might be broken."],
  "Improv": ["You can do anything! Swing from a chandlier! Climb up a cliff! Pole vault over a rushing river! Talk to the DM to figure out what is possible in the current situation."]
 },
 "Druid": {
  "Wild Shape": ["Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.","Your druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesnt have a flying or swimming speed.","You can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.","While you are transformed, the following rules apply:", "Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creatures bonus instead of yours. If the creature has any legendary or lair actions, you cant use them.", "When you transform, you assume the beasts hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesnt reduce your normal form to 0 hit points, you arent knocked unconscious.", "You cant cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesnt break your concentration on a spell youve already cast, however, or prevent you from taking actions that are part of a spell, such as call lightning, that youve already cast.","You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you cant use any of your special senses, such as darkvision, unless your new form also has that sense.","You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creatures shape and size. Your equipment doesnt change size or shape to match the new form, and any equipment that the new form cant wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form."]
 },
 "Fighter": {
  "Second Wind": ["You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again."],
  "Action Surge": ["Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action.", "Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn."],
  "Indomitable": ["Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you cant use this feature again until you finish a long rest.", "You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level."]
 },
 "Paladin": {
  "Lay on Hands": ["Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level x 5.", "As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.", "Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.", "This feature has no effect on undead and constructs."],
  "Divine Smite": ["Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapons damage.", "The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend, to a maximum of 6d8."],
  "Channel Divinity": ["Your oath allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your oath explains how to use it.","When you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again.","Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC."],
  "Aura of Protection": ["Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier. You must be conscious to grant this bonus.","At 18th level, the range of this aura increases to 30 feet."]
 },
 "Ranger (UA)": {
  "Natural Explorer": ["You are a master of navigating the natural world, and you react with swift and decisive action when attacked. This grants you the following benefits:","You ignore difficult terrain.","You have advantage on initiative rolls.","On your first turn during combat, you have advantage on attack rolls against creatures that have not yet acted.","In addition, you are skilled at navigating the wilderness. You gain the following benefits when traveling for an hour or more:","Difficult terrain doesnt slow your groups travel.","Your group cant become lost except by magical means.","Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.","If you are traveling alone, you can move stealthily at a normal pace.","When you forage, you find twice as much food as you normally would.","While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area."],
  "Primeval Awareness": ["Beginning at 3rd level, your mastery of ranger lore allows you to establish a powerful link to beasts and to the land around you.","You have an innate ability to communicate with beasts, and they recognize you as a kindred spirit. Through sounds and gestures, you can communicate simple ideas to a beast as an action, and can read its basic mood and intent. You learn its emotional state, whether it is affected by magic of any sort, its short-term needs (such as food or safety), and actions you can take (if any) to persuade it to not attack.","You cannot use this ability against a creature that you have attacked within the past 10 minutes.","Additionally, you can attune your senses to determine if any of your favored enemies lurk nearby. By spending 1 uninterrupted minute in concentration (as if you were concentrating on a spell), you can sense whether any of your favored enemies are present within 5 miles of you. This feature reveals which of your favored enemies are present, their numbers, and the creatures general direction and distance (in miles) from you.","If there are multiple groups of your favored enemies within range, you learn this information for each group."],
  "Fleet of Foot": ["Beginning at 8th level, you can use the Dash action as a bonus action on your turn."],
  "Hide in Plain Sight": ["Starting at 10th level, you can remain perfectly still for long periods of time to set up ambushes.","When you attempt to hide on your turn, you can opt to not move on that turn. If you avoid moving, creatures that attempt to detect you take a -10 penalty to their Wisdom (Perception) checks until the start of your next turn. You lose this benefit if you move or fall prone, either voluntarily or because of some external effect. You are still automatically detected if any effect or action causes you to no longer be hidden.","If you are still hidden on your next turn, you can continue to remain motionless and gain this benefit until you are detected."]
 }
}